backend-api/app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
---
    public function login()
    {
        $db = \Config\Database::connect();

        // Mengambil kiriman data JSON dari Axios Frontend VueJS
        $json = $this->request->getJSON();

        if (!$json || !isset($json->username) || !isset($json->password)) {
            return $this->fail('Username dan Password wajib diisi!', 400);
        }

        $username = $json->username;
        $password = $json->password;

        // Cari record data admin di tabel users
        $user = $db->table('users')->getWhere(['username' => $username])->getRow();

UPDATE `users` SET `token` = 'b03f5784f65cee4a581d30ac8988edf1f5286b7ff599b83e6169feca22befd1f'
WHERE `id` = '1'
---
                $token = bin2hex(random_bytes(32));

                // Update data token baru ke dalam database tabel users
                $db->table('users')->where('id', $user->id)->update(['token' => $token]);

UPDATE `users` SET `token` = NULL
WHERE `token` = 'b03f5784f65cee4a581d30ac8988edf1f5286b7ff599b83e6169feca22befd1f'
---
    public function logout()
    {
        $db = \Config\Database::connect();

        // Mengambil Authorization Bearer Token dari request header
        $authHeader = $this->request->getServer('HTTP_AUTHORIZATION');
        if ($authHeader && preg_match('/Bearer\s(\S+)/', $authHeader, $matches)) {
            $token = $matches[1];

            // Hapus eksistensi token dengan mengubah nilainya menjadi NULL kembali
            $db->table('users')->where('token', $token)->update(['token' => null]);