backend-api/app/Controllers/BarangController.php

    public function index()
    {
        $model = new BarangModel();

        // Mengambil semua data barang dari database
        $data = $model->findAll();
---
SELECT *
FROM `barang`

    public function create()
    {
        $model = new BarangModel();
        $json  = $this->request->getJSON(); // Menerima payload JSON dari Axios VueJS

        if (!$json) {
            return $this->fail('Payload data tidak boleh kosong.', 400);
        }

        $data = [
            'id_kategori' => $json->id_kategori ?? 1, // Default ke id_kategori 1 jika tidak diisi
            'nama_barang' => $json->nama_barang ?? null,
            'stok'        => $json->stok ?? 0,
            'harga'       => $json->harga ?? 0,
            'supplier'    => $json->supplier ?? null,
        ];

        // Validasi input minimal sebelum insert
        if (empty($data['nama_barang'])) {
            return $this->fail('Nama barang wajib diisi!', 400);
        }

        if ($model->insert($data)) {
---
INSERT INTO `barang` (`id_kategori`, `nama_barang`, `stok`, `harga`, `supplier`) VALUES (1, 'sepatu', 190, 150000, 'tokobunda')

    public function update($id = null)
    {
        $model = new BarangModel();
        $json  = $this->request->getJSON();

        if (!$id) {
            return $this->fail('ID barang tidak spesifik atau tidak ditemukan.', 400);
        }

        // Cek apakah data barang memang ada di database
        if (!$model->find($id)) {
            return $this->failNotFound('Data barang yang ingin diperbarui tidak ditemukan.');
        }

        if (!$json) {
            return $this->fail('Tidak ada perubahan data yang dikirim.', 400);
        }

        $data = [
            'id_kategori' => $json->id_kategori ?? 1,
            'nama_barang' => $json->nama_barang,
            'stok'        => $json->stok,
            'harga'       => $json->harga,
            'supplier'    => $json->supplier,
        ];

        if ($model->update($id, $data)) {
---
UPDATE `barang` SET `id_kategori` = '1', `nama_barang` = 'sepatu', `stok` = 100, `harga` = 150000, `supplier` = 'tokobunda'
WHERE `barang`.`id_barang` IN ('7')

    public function beli()
    {
        $db    = \Config\Database::connect();
        $model = new BarangModel();
        $json  = $this->request->getJSON();

        // Ditambahkan pengecekan payload metode_pembayaran sesuai arahan checkout baru
        if (!$json || !isset($json->id_barang) || !isset($json->jumlah) || !isset($json->metode_pembayaran)) {
            return $this->fail('Data pembelian atau metode pembayaran tidak lengkap.', 400);
        }

        $id_barang  = $json->id_barang;
        $jumlahBeli = (int)$json->jumlah;
        $metode     = $json->metode_pembayaran;

        // Cari barang berdasarkan ID
        $barang = $model->find($id_barang);
---
SELECT *
FROM `barang`
WHERE `barang`.`id_barang` = '5'

        $db->transStart();

        // 1. Update sisa persediaan barang
        $model->update($id_barang, ['stok' => $stokBaru]);

        // 2. Insert record baru ke dalam tabel log riwayat transaksi penjualan
        $db->table('transaksi')->insert([
            'id_barang'         => $id_barang,
            'nama_barang'       => $barang['nama_barang'],
            'jumlah'            => $jumlahBeli,
            'total_harga'       => $totalHarga,
            'metode_pembayaran' => $metode
        ]);
---
UPDATE `barang` SET `stok` = 46
WHERE `barang`.`id_barang` IN ('5')
INSERT INTO `transaksi` (`id_barang`, `nama_barang`, `jumlah`, `total_harga`, `metode_pembayaran`) VALUES ('5', 'pulpen', 2, 10000, 'Cash')

    public function getTransaksi()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('transaksi')->orderBy('id_transaksi', 'DESC');

        return $this->respond($builder->get()->getResultArray(), 200);
---
SELECT *
FROM `transaksi`
ORDER BY `id_transaksi` DESC