backend-api/app/Filters/AuthFilter.php

SELECT *
FROM `users`
WHERE `token` = 'b03f5784f65cee4a581d30ac8988edf1f5286b7ff599b83e6169feca22befd1f'
---
    public function before(RequestInterface $request, $arguments = null)
    {
        // JALUR AMAN: Jika request adalah OPTIONS (Preflight dari browser), langsung loloskan!
        // Ini sangat krusial agar browser tidak memblokir CORS saat berkomunikasi dengan VueJS
        if (strtolower($request->getMethod()) === 'options') {
            return;
        }

        // Ambil header Authorization dari request frontend
        $authHeader = $request->getServer('HTTP_AUTHORIZATION');

        // Jika header tidak ada atau tidak diawali dengan 'Bearer '
        if (!$authHeader || !preg_match('/Bearer\s(\S+)/', $authHeader, $matches)) {
            $response = Services::response();
            $response->setStatusCode(401);
            $response->setJSON([
                'status'  => false,
                'message' => 'Akses Ditolak. Token tidak ditemukan atau format salah.'
            ]);
            return $response;
        }

        $token = $matches[1];
        $db    = \Config\Database::connect();

        // Cek apakah token terdaftar di database tabel users
        $user = $db->table('users')->getWhere(['token' => $token])->getRow();